# coding: utf-8
import SnippetGetter as Snip
import os
import sys
import re
import MeCab
from time import sleep

onomatopoeias = ["うらうら", "おっとり", "かっ", "かっか", "かんかん", "ぎらぎら", "けろり", "さんさん", "じりじり", "すかっ", "てかてか", "とっぷり", "なんなん", "ぽかぽか", "ぽっ", "ごろごろ", "こんこん", "ざーざー", "さーっ", "さっ", "ざーっ", "ざっ", "ざざっ", "ざんざら", "ざんざん", "しとしと", "じとじと", "じめじめ", "しゃりしゃり", "しょぼしょぼ", "ちらほら", "どしゃどしゃ", "どんより", "はらはら", "ばらばら", "ぱらぱら", "びしゃびしゃ", "びちゃびちゃ", "びしょびしょ", "びちょびちょ", "ぽつぽつ", "みりり", "ごーっ", "さーさー", "さーっ", "ざーっ", "さやさや", "さわさわ", "ざんざ", "すーすー", "すーっ", "すかすか", "そよそよ", "そよ", "そより", "はたはた", "ばたばた", "ぱたぱた", "ひゅー", "ぴゅー", "びゅー", "ひゅーひゅー", "びゅーびゅー", "ぴゅーぴゅー", "ひゅっ", "びゅっ", "ぴゅっ", "ひゅるるん", "びゅんびゅん", "ぴゅんぴゅん", "ふー", "ぶぉーっ", "ぶんぶん", "わさわさ"]

#onomatopoeias = ["うろうろ", "えっちらおっちら", "かっぽかっぽ", "さっさ", "さっさっ", "しゃなりしゃなり", "しゃらりしゃらり", "すたこら", "すたこらさっさ","すたすた", "せかせか", "たー", "たたーっ", "たかたか", "たじたじ", "だだーっ", "たたたた", "だだだだ", "たったかたったか", "たったっ", "たどたど", "ちょこちょこ", "てくてく", "てけてけ", "どっしどっし", "とーん", "とことこ", "とっとことっとこ", "とっと", "とっとっ", "ととと", "どたばた", "とぼとぼ", "のさのさ", "のしのし", "のそのそ", "のっしのっし", "のらりのらり", "のろのろ", "のろりのろり", "ぱかぱか", "ぱっぱか", "ぱたぱた", "ばたばた", "ぴたぴた", "ひょこひょこ", "ふらふら", "ぶらぶら", "よたよた", "よちよち", "よぼよぼ", "よろよろ", "らったった", "わたわた", "のこのこ", "ぱっぱ"]
#onomatopoeias = ["びゅうびゅう", "ざあざあ", "てくてく", "がたがた"]


def main():
  for onomatope in onomatopoeias:
    snippets = Snip.get_ameba(onomatope)
      #スニペットを一行ずつ書き出し
    for snippet in snippets:
      txt = open('weather/'+onomatope+'.txt', 'a')
      txt.write(str(snippet)+'\n')
      txt.close()

    print onomatope
    print 'stop'
    sleep(900)
    print 'restart'
    
if (__name__ == '__main__'):
  main()
